Repository: MirrorAzure/Stronghold-Finder
Catalog: locale/*/LC_MESSAGES/main.po
Languages: ru_ru

source: Stronghold Finder by MirrorAzure
ru_ru: Искатель Крепости от MirrorAzure

source: Info
ru_ru: Информация

source: First throw
ru_ru: Первый бросок

source: Angle:
ru_ru: Угол:

source: Second throw
ru_ru: Второй бросок

source: Calculate
ru_ru: Рассчитать

source: Lines are parallel. Please enter another point.
ru_ru: Линии параллельны. Введите другую точку.

source: Estimated stronghold location:
ru_ru: Предполагаемое расположение крепости:

source: Error occurred. Please fill all forms correctly.
ru_ru: Произошла ошибка. Проверьте правильность ввода.

source: Welcome to "Stronghold Finder"! This is a simple offline program that will help you find a stronghold in Minecraft. The search for a stronghold is based on the triangulation method. Thanks to it, you will spend much less time and resources than when using the classic method.
ru_ru: Добро пожаловать в "Искатель Крепости"! Это простая оффлайн-программа, которая поможет вам найти крепость в игре Minecraft. Поиск крепости реализован методом триангуляции, за счёт чего вы потратите намного меньше времени и ресурсов, чем при классических методах.

source: How to use the program: 1. Enter the game and take your eyes of ender; 2. Take a position with a good view; 3. Use eye of ender and point your cursor on flying eye (it's better to aim to the center); 4. Without moving your character or camera, press F3, write X and Z coordinates, and also your horizontal rotation (first number in "Facing" row) in coresponding fields of the program; 5. Take another position (preferably at a distance of 400-500 blocks from the first) and do steps 2-4 again; 6. Press the "Calculate" button. 7. All done! You\'re awesome!
ru_ru: Как пользоваться программой: 1. Зайдите в игру и возьмите предмет "Око Эндера"; 2. Займите удобную позицию, откуда открывается хороший обзор; 3. Используйте Око Эндера и наведите курсор на взлетевший глаз (лучше всего навести его прямо в центр глаза); 4. Не меняя положение персонажа и камеры, нажмите клавишу F3, запишите координаты X и Z, а также угол поворота (первое число в строке "Facing") в соответствующие поля программы; 5. Займите другую позицию (желательно на расстоянии 400-500 блоков от первой) и проделайте шаги 2-4 с ней; 6. Нажмите кнопку "Рассчитать". 7. Готово! Вы великолепны!

source: If you made everything right, the program should display estimated coordinates of stronghold. Because of the error, actual coordinates of stronghold may differ by 100-200 blocks. However, even with an error, finding stronghold wiil be much easier. I made this program at the request of my friend. Hello, Zavergan, if you're reading this. I took on the project to get some practice in building the user interface and internationalizing the app. Good luck to you and all the best!
ru_ru: Если вы ввели всё правильно, программа должна вывести предполагаемые координаты крепости. Из-за погрешностей вычислений, настоящие координаты могут отличаться приблизительно на 100-200 блоков. Однако, так найти крепость будет намного проще. Программа была создана по просьбе моего друга. Поэтому привет тебе, Заверган, если ты это читаешь. Я решил взяться за проект, чтобы немного попрактиковаться в создании пользовательского интерфейса и интернационализации приложения. Успехов вам и всего доброго!
